In [1]:
import pandas as pd
import numpy as np

In [2]:
train = pd.read_csv('/Users/maheswarareddy/Documents/Tech/Kaggle/Titanic/train.csv')
test = pd.read_csv('/Users/maheswarareddy/Documents/Tech/Kaggle/Titanic/test.csv')

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [7]:
train.groupby('Pclass')['Survived'].agg([np.sum, np.mean, np.std])

        sum      mean       std
Pclass
1       136  0.629630  0.484026
2        87  0.472826  0.500623
3       119  0.242363  0.428949

In [8]:
one_hot = pd.get_dummies(train['Pclass'])
one_hot

     1  2  3
0    0  0  1
1    1  0  0
2    0  0  1
3    1  0  0
4    0  0  1
..  .. .. ..
886  0  1  0
887  1  0  0
888  0  0  1
889  1  0  0
890  0  0  1

[891 rows x 3 columns]

In [9]:
train = train.drop('Pclass',axis = 1)
train

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
train = train.join(one_hot)
train.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,1,2,3
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,0,0
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1

In [11]:
#train = train.rename(columns={'1':'Pclass_1','2':'Pclass_2','3':'Pclass_3'}, inplace=True)

In [12]:
train.columns = ['Pclass_1' if x==1 else x for x in train.columns]
train.columns = ['Pclass_2' if x==2 else x for x in train.columns]
train.columns = ['Pclass_3' if x==3 else x for x in train.columns]
train.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,0,0
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1

In [13]:
one_hot_pclass = pd.get_dummies(test['Pclass'])
test = test.drop('Pclass',axis = 1)
test = test.join(one_hot_pclass)
test.columns = ['Pclass_1' if x==1 else x for x in test.columns]
test.columns = ['Pclass_2' if x==2 else x for x in test.columns]
test.columns = ['Pclass_3' if x==3 else x for x in test.columns]
test.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3
0,892,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0,0,1
1,893,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0,0,1
2,894,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0,1,0
3,895,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0,0,1

In [14]:
train.groupby('Sex')['Survived'].agg([np.sum, np.mean, np.std])

        sum      mean       std
Sex
female  233  0.742038  0.438211
male    109  0.188908  0.391775

In [15]:
from sklearn.preprocessing import LabelEncoder

lb_make = LabelEncoder()
train['Sex'] = lb_make.fit_transform(train['Sex'])

train.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3
0,1,0,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0
2,3,1,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S,1,0,0
4,5,0,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S,0,0,1

In [16]:
test['Sex'] = lb_make.fit_transform(test['Sex'])

test.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3
0,892,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q,0,0,1
1,893,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S,0,0,1
2,894,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q,0,1,0
3,895,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S,0,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S,0,0,1

In [17]:
train.groupby('Sex')['Survived'].agg([np.sum, np.mean, np.std])

     sum      mean       std
Sex
0    233  0.742038  0.438211
1    109  0.188908  0.391775

In [18]:
one_hot_Sex = pd.get_dummies(train['Sex'])
train = train.drop('Sex',axis = 1)
train = train.join(one_hot_Sex)
train.columns = ['male' if x==1 else x for x in train.columns]
train.columns = ['female' if x==0 else x for x in train.columns]
train.head()

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3,female,male
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,1,0,0,1,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1,1,0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,1,0,0,1,0
4,5,0,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,0,0,1,0,1

In [19]:
one_hot_Sext = pd.get_dummies(test['Sex'])
test = test.drop('Sex',axis = 1)
test = test.join(one_hot_Sext)
test.columns = ['male' if x==1 else x for x in test.columns]
test.columns = ['female' if x==0 else x for x in test.columns]
test.head()

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3,female,male
0,892,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,Q,0,0,1,0,1
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,NaN,S,0,0,1,1,0
2,894,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,NaN,Q,0,1,0,0,1
3,895,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,NaN,S,0,0,1,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,NaN,S,0,0,1,1,0

In [20]:
train.isnull().sum()

PassengerId      0
Survived         0
Name             0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Pclass_1         0
Pclass_2         0
Pclass_3         0
female           0
male             0
dtype: int64

In [21]:
test.isnull().sum()

PassengerId      0
Name             0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
Pclass_1         0
Pclass_2         0
Pclass_3         0
female           0
male             0
dtype: int64

In [22]:
train['Age'].fillna((train['Age'].mean()), inplace=True)
train.isnull().sum()

PassengerId      0
Survived         0
Name             0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Pclass_1         0
Pclass_2         0
Pclass_3         0
female           0
male             0
dtype: int64

In [23]:
test['Age'].fillna((test['Age'].mean()), inplace=True)
test.isnull().sum()

PassengerId      0
Name             0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
Pclass_1         0
Pclass_2         0
Pclass_3         0
female           0
male             0
dtype: int64

In [24]:
test['Fare'].fillna((test['Fare'].mean()), inplace=True)
test.isnull().sum()

PassengerId      0
Name             0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
Pclass_1         0
Pclass_2         0
Pclass_3         0
female           0
male             0
dtype: int64

In [25]:
train.groupby('Embarked')['Survived'].agg([np.sum, np.mean, np.std])

          sum      mean       std
Embarked
C          93  0.553571  0.498608
Q          30  0.389610  0.490860
S         217  0.336957  0.473037

In [26]:
labels = train['Embarked'].astype('category').cat.categories.tolist()
replace_map_comp = {'Embarked' : {k: v for k,v in zip(labels,list(range(1,len(labels)+1)))}}

print(replace_map_comp)

{'Embarked': {'C': 1, 'Q': 2, 'S': 3}}

In [27]:
train.replace(replace_map_comp, inplace=True)

train.head()

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3,female,male
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,3.0,0,0,1,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,1.0,1,0,0,1,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,3.0,0,0,1,1,0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,3.0,1,0,0,1,0
4,5,0,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,3.0,0,0,1,0,1

In [28]:
labelst = test['Embarked'].astype('category').cat.categories.tolist()
replace_map_compt = {'Embarked' : {k: v for k,v in zip(labelst,list(range(1,len(labelst)+1)))}}
test.replace(replace_map_compt, inplace=True)

test.head()

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3,female,male
0,892,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,2,0,0,1,0,1
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,NaN,3,0,0,1,1,0
2,894,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,NaN,2,0,1,0,0,1
3,895,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,NaN,3,0,0,1,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,NaN,3,0,0,1,1,0

In [29]:
train.isnull().sum()

PassengerId      0
Survived         0
Name             0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Pclass_1         0
Pclass_2         0
Pclass_3         0
female           0
male             0
dtype: int64

In [30]:
train['Embarked'].fillna((train['Embarked'].min()), inplace=True)
train.isnull().sum()

PassengerId      0
Survived         0
Name             0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
Pclass_1         0
Pclass_2         0
Pclass_3         0
female           0
male             0
dtype: int64

In [31]:
from sklearn.preprocessing import LabelBinarizer

lb = LabelBinarizer()
lb_results = lb.fit_transform(train['Embarked'])
lb_results_df = pd.DataFrame(lb_results, columns=lb.classes_)

print(lb_results_df.head())

   1.0  2.0  3.0
0    0    0    1
1    1    0    0
2    0    0    1
3    0    0    1
4    0    0    1

In [32]:
train = pd.concat([train, lb_results_df], axis=1)

print(train.head())

   PassengerId  Survived                                               Name  \
0            1         0                            Braund, Mr. Owen Harris
1            2         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3         1                             Heikkinen, Miss. Laina
3            4         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5         0                           Allen, Mr. William Henry

    Age  SibSp  Parch            Ticket     Fare Cabin  Embarked  Pclass_1  \
0  22.0      1      0         A/5 21171   7.2500   NaN       3.0         0
1  38.0      1      0          PC 17599  71.2833   C85       1.0         1
2  26.0      0      0  STON/O2. 3101282   7.9250   NaN       3.0         0
3  35.0      1      0            113803  53.1000  C123       3.0         1
4  35.0      0      0            373450   8.0500   NaN       3.0         0

   Pclass_2  Pclass_3  female  male  1.0  2.0  3.0
0         0         1       0     1    0    0    1
1         0         0       1     0    1    0    0
2         0         1       1     0    0    0    1
3         0         0       1     0    0    0    1
4         0         1       0     1    0    0    1

In [33]:
lbt = LabelBinarizer()
lbt_results = lbt.fit_transform(test['Embarked'])
lbt_results_df = pd.DataFrame(lbt_results, columns=lbt.classes_)

test = pd.concat([test, lbt_results_df], axis=1)

test.head()

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3,female,male,1,2,3
0,892,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,2,0,0,1,0,1,0,1,0
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,NaN,3,0,0,1,1,0,0,0,1
2,894,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,NaN,2,0,1,0,0,1,0,1,0
3,895,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,NaN,3,0,0,1,0,1,0,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,NaN,3,0,0,1,1,0,0,0,1

In [34]:
train = train.drop('Embarked',axis = 1)
train.head()

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Pclass_1,Pclass_2,Pclass_3,female,male,1.0,2.0,3.0
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,0,0,1,0,1,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,1,0,0,1,0,1,0,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1,1,0,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,1,0,0,1,0,0,0,1
4,5,0,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,0,0,1,0,1,0,0,1

In [35]:
train.columns = ['Emb_C' if x==1.0 else x for x in train.columns]
train.columns = ['Emb_Q' if x==2.0 else x for x in train.columns]
train.columns = ['Emb_S' if x==3.0 else x for x in train.columns]
train.head()

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,0,0,1,0,1,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,1,0,0,1,0,1,0,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1,1,0,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,1,0,0,1,0,0,0,1
4,5,0,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,0,0,1,0,1,0,0,1

In [36]:
test = test.drop('Embarked',axis = 1)
test.columns = ['Emb_C' if x==1.0 else x for x in test.columns]
test.columns = ['Emb_Q' if x==2.0 else x for x in test.columns]
test.columns = ['Emb_S' if x==3.0 else x for x in test.columns]
test.head()

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S
0,892,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,0,0,1,0,1,0,1,0
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,NaN,0,0,1,1,0,0,0,1
2,894,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,NaN,0,1,0,0,1,0,1,0
3,895,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,NaN,0,0,1,0,1,0,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,NaN,0,0,1,1,0,0,0,1

In [37]:
train_1 = train.drop(['PassengerId','Name','Ticket','Cabin'],axis = 1)
train.head()

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,0,0,1,0,1,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,1,0,0,1,0,1,0,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1,1,0,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,1,0,0,1,0,0,0,1
4,5,0,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,0,0,1,0,1,0,0,1

In [38]:
test_1 = test.drop(['PassengerId','Name','Ticket','Cabin'],axis = 1)
train.head()

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,0,0,1,0,1,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,1,0,0,1,0,1,0,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1,1,0,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,1,0,0,1,0,0,0,1
4,5,0,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,0,0,1,0,1,0,0,1

In [39]:
train_1.head()

,Survived,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S
0,0,22.0,1,0,7.2500,0,0,1,0,1,0,0,1
1,1,38.0,1,0,71.2833,1,0,0,1,0,1,0,0
2,1,26.0,0,0,7.9250,0,0,1,1,0,0,0,1
3,1,35.0,1,0,53.1000,1,0,0,1,0,0,0,1
4,0,35.0,0,0,8.0500,0,0,1,0,1,0,0,1

In [40]:
test_1.head()

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S
0,34.5,0,0,7.8292,0,0,1,0,1,0,1,0
1,47.0,1,0,7.0000,0,0,1,1,0,0,0,1
2,62.0,0,0,9.6875,0,1,0,0,1,0,1,0
3,27.0,0,0,8.6625,0,0,1,0,1,0,0,1
4,22.0,1,1,12.2875,0,0,1,1,0,0,0,1

In [41]:
test_1['Survived'] = 0

In [42]:
test_1.head()

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S,Survived
0,34.5,0,0,7.8292,0,0,1,0,1,0,1,0,0
1,47.0,1,0,7.0000,0,0,1,1,0,0,0,1,0
2,62.0,0,0,9.6875,0,1,0,0,1,0,1,0,0
3,27.0,0,0,8.6625,0,0,1,0,1,0,0,1,0
4,22.0,1,1,12.2875,0,0,1,1,0,0,0,1,0

In [43]:
x_train = train_1.drop('Survived',axis = 1)
x_train.head()

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S
0,22.0,1,0,7.2500,0,0,1,0,1,0,0,1
1,38.0,1,0,71.2833,1,0,0,1,0,1,0,0
2,26.0,0,0,7.9250,0,0,1,1,0,0,0,1
3,35.0,1,0,53.1000,1,0,0,1,0,0,0,1
4,35.0,0,0,8.0500,0,0,1,0,1,0,0,1

In [44]:
y_train = train_1[['Survived']]
y_train.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [45]:
x_test = test_1.drop('Survived',axis = 1)
x_test.head()

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,female,male,Emb_C,Emb_Q,Emb_S
0,34.5,0,0,7.8292,0,0,1,0,1,0,1,0
1,47.0,1,0,7.0000,0,0,1,1,0,0,0,1
2,62.0,0,0,9.6875,0,1,0,0,1,0,1,0
3,27.0,0,0,8.6625,0,0,1,0,1,0,0,1
4,22.0,1,1,12.2875,0,0,1,1,0,0,0,1

In [46]:
y_test = test_1[['Survived']]
y_test.head()

   Survived
0         0
1         0
2         0
3         0
4         0

In [47]:
data_final_vars=train_1.columns.values.tolist()
y=['Survived']
X=[i for i in data_final_vars if i not in y]

from sklearn.feature_selection import RFE
from sklearn.linear_model import LogisticRegression
logreg = LogisticRegression()
rfe = RFE(logreg, 20)
rfe = rfe.fit(x_train, y_train.values.ravel())
print(rfe.support_)
print(rfe.ranking_)

[ True  True  True  True  True  True  True  True  True  True  True  True]
[1 1 1 1 1 1 1 1 1 1 1 1]

/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [48]:
from sklearn.linear_model import LogisticRegression
logmodel = LogisticRegression()
logmodel.fit(x_train,y_train)
predictions = logmodel.predict(x_test)

/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/sklearn/utils/validation.py:724: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [49]:
from sklearn.metrics import classification_report
print(classification_report(y_test,predictions))

              precision    recall  f1-score   support

           0       1.00      0.63      0.77       418
           1       0.00      0.00      0.00         0

    accuracy                           0.63       418
   macro avg       0.50      0.32      0.39       418
weighted avg       1.00      0.63      0.77       418

/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/sklearn/metrics/classification.py:1439: UndefinedMetricWarning: Recall and F-score are ill-defined and being set to 0.0 in labels with no true samples.
  'recall', 'true', average, warn_for)

In [50]:
#conda install statsmodels
import statsmodels.api as sm
logit_model=sm.Logit(y_train,x_train)
result=logit_model.fit()
print(result.summary2())

Optimization terminated successfully.
         Current function value: 0.440036
         Iterations 7
                         Results: Logit
=================================================================
Model:              Logit            Pseudo R-squared: 0.339
Dependent Variable: Survived         AIC:              804.1442
Date:               2019-12-15 09:55 BIC:              852.0676
No. Observations:   891              Log-Likelihood:   -392.07
Df Model:           9                LL-Null:          -593.33
Df Residuals:       881              LLR p-value:      3.9895e-81
Converged:          1.0000           Scale:            1.0000
No. Iterations:     7.0000
------------------------------------------------------------------
               Coef.   Std.Err.     z     P>|z|    [0.025   0.975]
------------------------------------------------------------------
Age           -0.0391    0.0079  -4.9706  0.0000  -0.0546  -0.0237
SibSp         -0.3226    0.1097  -2.9416  0.0033  -0.5375  -0.1076
Parch         -0.0963    0.1191  -0.8092  0.4184  -0.3297   0.1370
Fare           0.0023    0.0025   0.9197  0.3577  -0.0026   0.0071
Pclass_1       1.4732       nan      nan     nan      nan      nan
Pclass_2       0.5463       nan      nan     nan      nan      nan
Pclass_3      -0.6795       nan      nan     nan      nan      nan
female         2.0279       nan      nan     nan      nan      nan
male          -0.6879       nan      nan     nan      nan      nan
Emb_C          0.6102       nan      nan     nan      nan      nan
Emb_Q          0.5724       nan      nan     nan      nan      nan
Emb_S          0.1575       nan      nan     nan      nan      nan
=================================================================

/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/statsmodels/base/model.py:1286: RuntimeWarning: invalid value encountered in sqrt
  bse_ = np.sqrt(np.diag(self.cov_params()))
/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/scipy/stats/_distn_infrastructure.py:901: RuntimeWarning: invalid value encountered in greater
  return (a < x) & (x < b)
/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/scipy/stats/_distn_infrastructure.py:901: RuntimeWarning: invalid value encountered in less
  return (a < x) & (x < b)
/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/scipy/stats/_distn_infrastructure.py:1892: RuntimeWarning: invalid value encountered in less_equal
  cond2 = cond0 & (x <= _a)

In [52]:
cols=['Age', 'SibSp', 'Parch','Fare'] 
x_train_1=x_train[cols]

In [53]:
import statsmodels.api as sm
logit_model=sm.Logit(y_train,x_train_1)
result=logit_model.fit()
print(result.summary2())

Optimization terminated successfully.
         Current function value: 0.612925
         Iterations 6
                         Results: Logit
=================================================================
Model:              Logit            Pseudo R-squared: 0.080
Dependent Variable: Survived         AIC:              1100.2329
Date:               2019-12-15 16:34 BIC:              1119.4023
No. Observations:   891              Log-Likelihood:   -546.12
Df Model:           3                LL-Null:          -593.33
Df Residuals:       887              LLR p-value:      2.4574e-20
Converged:          1.0000           Scale:            1.0000
No. Iterations:     6.0000
-------------------------------------------------------------------
           Coef.    Std.Err.      z      P>|z|     [0.025    0.975]
-------------------------------------------------------------------
Age       -0.0294     0.0031   -9.5164   0.0000   -0.0355   -0.0234
SibSp     -0.3458     0.0825   -4.1925   0.0000   -0.5074   -0.1841
Parch      0.0903     0.0983    0.9189   0.3582   -0.1023    0.2830
Fare       0.0187     0.0027    7.0202   0.0000    0.0134    0.0239
=================================================================

In [54]:
cols=['Age', 'SibSp', 'Fare'] 
x_train_2=x_train[cols]

In [55]:
import statsmodels.api as sm
logit_model=sm.Logit(y_train,x_train_2)
result=logit_model.fit()
print(result.summary2())

Optimization terminated successfully.
         Current function value: 0.613394
         Iterations 6
                         Results: Logit
=================================================================
Model:              Logit            Pseudo R-squared: 0.079
Dependent Variable: Survived         AIC:              1099.0678
Date:               2019-12-15 16:35 BIC:              1113.4448
No. Observations:   891              Log-Likelihood:   -546.53
Df Model:           2                LL-Null:          -593.33
Df Residuals:       888              LLR p-value:      4.7617e-21
Converged:          1.0000           Scale:            1.0000
No. Iterations:     6.0000
-------------------------------------------------------------------
           Coef.    Std.Err.      z      P>|z|     [0.025    0.975]
-------------------------------------------------------------------
Age       -0.0293     0.0031   -9.4912   0.0000   -0.0353   -0.0232
SibSp     -0.3172     0.0758   -4.1841   0.0000   -0.4658   -0.1686
Fare       0.0190     0.0026    7.2445   0.0000    0.0139    0.0242
=================================================================

In [57]:
from sklearn.linear_model import LogisticRegression
from sklearn import metrics
logreg = LogisticRegression()
logreg.fit(x_train_2, y_train)

/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
/Users/maheswarareddy/anaconda3/lib/python3.6/site-packages/sklearn/utils/validation.py:724: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [59]:
x_test_1 = x_test[cols]

In [61]:
y_pred = logreg.predict(x_test_1)
print('Accuracy of logistic regression classifier on test set: {:.2f}'.format(logreg.score(x_test_1, y_test)))

Accuracy of logistic regression classifier on test set: 0.85

In [62]:
sub = pd.read_csv('/Users/maheswarareddy/Documents/Tech/Kaggle/Titanic/gender_submission.csv')
sub.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [64]:
y_pred

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0])

In [66]:
type(y_pred)

numpy.ndarray

In [70]:
sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
PassengerId    418 non-null int64
Survived       418 non-null int64
dtypes: int64(2)
memory usage: 6.7 KB

In [80]:
sub[["Survived"]] = 0

In [81]:
sub.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

In [88]:
len(y_pred)

418

In [89]:
len(sub)

418

In [92]:
sub["test"] = y_pred

In [96]:
old_names = ['PassengerId', 'Survived', 'test'] 
new_names = ['PassengerId', 'test', 'Survived']
sub.rename(columns=dict(zip(old_names, new_names)), inplace=True)

In [97]:
sub.head()

   PassengerId  test  Survived
0          892     0         0
1          893     0         0
2          894     0         0
3          895     0         0
4          896     0         0

In [100]:
sub_1 = sub.drop('test',axis = 1)
sub_1.head(n = 20)

    PassengerId  Survived
0           892         0
1           893         0
2           894         0
3           895         0
4           896         0
5           897         0
6           898         0
7           899         0
8           900         0
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0
14          906         0
15          907         0
16          908         0
17          909         0
18          910         0
19          911         0

In [101]:
sub_1.to_csv('out_logistic_mahesh.csv')

In [104]:
sub_1.columns

Index(['PassengerId', 'Survived'], dtype='object')